Revit 2024 API
AnalyticalAlignmentMethod Enumeration
 Specifies how analytical model is being aligned in space
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
[ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum AnalyticalAlignmentMethod
Visual Basic
<ObsoleteAttribute("This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")> _
Public Enumeration AnalyticalAlignmentMethod
Visual C++
[ObsoleteAttribute(L"This enum is deprecated in Revit 2023 and may be removed in a future version of Revit.")]
public enum class AnalyticalAlignmentMethod
Members
Member name | Description
AutoDetect |  Auto-detect projections for analytical model.
Projection |  Manually set projections for analytical model using projection parameters.
ManuallyAdjusted |  Reports if analytical model has been manually adjusted, this value can only set internally by Revit.
Varies |  Alignment types are different at each end.
See Also
Autodesk.Revit.DB.Structure Namespace